<template>
    <main class="m-3">
        <div class="container">
            <div class="row justify-content-center">
                <div class="col-md-8">
                    <Stepper v-model="current"
                        :items="[
                            { label: 'Step 1' },
                            { label: 'Step 2' },
                            { label: 'Step 3' },
                            { label: 'Step 4' },
                        ]">
                        <template #item:1>
                            ফরিদপুরের সালথায় গুরুত্বপূর্ণ একটি সড়ক বেহাল হয়ে পড়ায় চরম ভোগান্তিতে পড়েছেন এলাকাবাসী। এর ওপর
                            কয়েক বছর ধরে সড়কটির মালিকানা নিয়ে জটিলতা সৃষ্টি হওয়ায় এর সংস্কারকাজ হচ্ছে না। সড়কটির আধা
                            কিলোমিটারজুড়ে পিচ উঠে গেছে। একটু পরপরই সৃষ্টি হয়েছে খানাখন্দ।

                            উপজেলার সোনাপুর ইউনিয়ন থেকে সড়কটি চলে গেছে পাশের যদুনন্দী ইউনিয়নের খারদিয়া পর্যন্ত। স্থানীয়
                            লোকজন জানান, এ সড়কের দুই পাশে সোনাপুর, চান্দা খোলা, মিনাজদিয়া গ্রাম, বড়খাড়দিয়াসহ অন্তত ২০টি
                            গ্রাম অবস্থিত। ওই গ্রামগুলোর কয়েক হাজার লোক রোজকার কাজে সড়কটি ব্যবহার করেন। ওই এলাকার
                            বাসিন্দাদের সালথা উপজেলা সদরে যাওয়ার এটিই একমাত্র সড়ক। এই পথ দিয়েই শিক্ষার্থীরা খারদিয়া সরকারি
                            প্রাথমিক বিদ্যালয় ও খারদিয়া উচ্চবিদ্যালয়ে আসা-যাওয়া করে। কয়েক শ কৃষক ভ্যানে করে কৃষিপণ্য বিক্রি
                            করতে এই সড়ক দিয়েই সালথা ও সোনাপুর বাজারে যান। সোনাপুর ইউনিয়ন পরিষদের (ইউপি) পাশ থেকে শুরু হয়েছে
                            এই সড়ক। তবে সড়কের সবচেয়ে খারাপ অবস্থা সোনাপুর পালবাড়ী থেকে খারদিয়া বাজারের সেতু পর্যন্ত আধা
                            কিলোমিটার অংশে।
                        </template>
                        <template #item:2>
                            সম্প্রতি সরেজমিনে দেখা যায়, সড়কের বিভিন্ন স্থানে খানাখন্দে ভরে গেছে। সোনাপুর পালবাড়ী থেকে
                            খারদিয়া বাজার ব্রিজ পর্যন্ত সড়কের ওই পথটুকুর বড় বড় গর্তের ভেতর দিয়ে হেলেদুলে চলছে সাইকেল,
                            মোটরসাইকেল, ইজিবাইক, ভ্যান-রিকশাসহ ছোট-বড় অসংখ্য যানবাহন। এর মধ্যে ঝুঁকি নিয়ে চলাচল করছেন
                            যাত্রীরা।

                            খারদিয়া গ্রামের বাসিন্দা কৃষক জালাল মোল্লা (৪৯) বলেন, খারদিয়া গ্রামের ১৮টি পাড়ার হাজারো মানুষ
                            জেলা-উপজেলা সদরে যাতায়াত করেন ভাঙাচোরা এই সড়ক দিয়ে। কিন্তু সড়কের যে অবস্থা, তাতে যানবাহনে চলাচল
                            করাই মুশকিল। তারপরও বাধ্য হয়ে মানুষ ঝুঁকি নিয়ে এই সড়ক দিয়ে যাতায়াত করছেন।

                            ওই পথে চলাচলকারী ইজিবাইকের চালক আনিচুর রহমান (৩৬) বলেন, এই সড়কে গাড়ি চালানোই মুশকিল। মাঝেমধ্যেই
                            বড় বড় গর্তে গাড়ির চাকা আটকে যায়, উল্টেও পড়ে। সড়কটি কয়েক বছর ধরে এভাবে পড়ে থাকলেও কেউ কোনো
                            ব্যবস্থা নিচ্ছেন না।
                        </template>
                        <template #item:3>
                            স্থানীয় সরকার প্রকৌশল অধিদপ্তর (এলজিইডি) এবং সড়ক ও জনপথ (সওজ) অধিদপ্তর সূত্রে জানা গেছে, ৩
                            কিলোমিটার দৈর্ঘ্য এবং ১২ ফুট প্রশস্ত সড়কটির মালিকানা আগে এলজিইডির অধীনে ছিল। পরে সালথা থেকে
                            সোনাপুর হয়ে বোয়ালমারীর ময়েন্দিয়া পর্যন্ত বাস চলাচলকারী একটি আঞ্চলিক সড়ক নির্মাণের প্রকল্প নেওয়া
                            হয়। ওই আঞ্চলিক সড়কের আধা কিলোমিটার অংশ সোনাপুর-যদুনন্দী সড়কের ওপর দিয়ে যাওয়ার কথা ছিল। এ জন্য ওই
                            আধা কিলোমিটার অংশের মালিকানা সওজের কাছে হস্তান্তর করা হয়। তবে সওজের ওই আঞ্চলিক সড়ক ঘুরিয়ে অন্য
                            এলাকা দিয়ে করা হয়। এখন ভাঙাচোরা হয়ে পড়ার পরও সওজ ওই আধা কিলোমিটার অংশে কোনো কাজ করছে না। এদিকে
                            এলজিইডির আওতাভুক্ত না থাকায় সড়কের ওই অংশে তারাও কোনো সংস্কার করতে পারছে না। এ জটিলতার কারণে
                            সড়কের ওই অংশ দীর্ঘদিন ধরে সংস্কারের অভাবে চলাচলের অনুপযুক্ত হয়ে রয়েছে।
                        </template>
                        <template #item:4>
                            সোনাপুর ইউপির চেয়ারম্যান মো. খায়রুজ্জামান বলেন, ‘সড়কটি অন্তত পাঁচ বছর ধরে বেহাল পড়ে আছে। আমি সড়ক
                            বিভাগ ও এলজিইডির সঙ্গে যোগাযোগ করেও এর সমাধান করতে পারিনি। সড়কের ওই অংশ আমাদের জন্য একটি বিষফোড়া
                            হয়ে আছে।’

                            এ ব্যাপারে যোগাযোগ করা হলে ফরিদপুর সওজের নির্বাহী প্রকৌশলী মো. ইমরান ফারহান বলেন, ‘সড়কটির ওই আধা
                            কিলোমিটার অংশের মালিকানা সওজের এবং সড়কে দীর্ঘদিন ধরে কোনো সংস্কারকাজ করা হয়নি, এ তথ্য আমার জানা
                            ছিল না। সড়কটির ওই অংশ দ্রুত সংস্কারের জন্য উদ্যোগ নেওয়া হবে।’
                        </template>
                    </Stepper>
                </div>
            </div>
        </div>
    </main>
</template>

<script setup>
import { ref } from 'vue';
import Stepper from '../components/Stepper.vue';

const current = ref(1);
</script>
